#include <semaphore.h>
/*******************************************************************************
                                 Semaphore API
********************************************************************************/
/* s_init(value)

   Инициализирует новый семафор со счетчиком семафоров, установленным в значение.
   Возвращаемое значение
   В случае успеха возвращается указатель на новый семафор. В случае неудачи
   выводится сообщение об ошибке и программа завершается.
*/
sem_t *s_init(unsigned int value);

/* s_wait(sem)
  Атомарно уменьшает счетчик семафора, на который указывает sem. Если
  значение счетчика семафора больше нуля, то декремент продолжается,
  и функция немедленно возвращается. Если в данный момент счетчик семафора имеет
  нулевое значение, то вызов блокируется до тех пор, пока другой процесс или поток 
  не подаст сигнал семафора.
*/
void s_wait(sem_t *sem);

/* s_signal(sem)
   Атомарно увеличивает счетчик семафора, на который указывает sem.  Если
   значение счетчика семафора в результате становится больше нуля, то
   другой процесс или поток, заблокированный вызовом s_wait(), будет
   будет разбужен и приступит к блокировке семафора.
*/
void s_signal(sem_t *sem);

/* s_destroy(sem)
   Уничтожает семафор, на который указывает sem. Только семафор, который был
   инициализирован с помощью s_init(), должен быть уничтожен с помощью s_destroy().
 */
void s_destroy(sem_t *sem);
